Fischer-Simon/esp32-ble-control/lib/Esp32BleUi/include/Esp32BleUi.h
/*
 * Part of Esp32BleControl a firmware to allow ESP32 remote control over BLE.
 * Copyright (C) 2024  Simon Fischer
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <https://www.gnu.org/licenses/>.
 */

#pragma once

#include <condition_variable>
#include <Esp32Cli.h>
#include <esp_task_wdt.h>
#include <KeyValueStore.h>
#include <mutex>
#include <NimBLEDevice.h>
#include <queue>
#include <RingBuffer.h>
#include <set>

class Esp32BleUi : public NimBLECharacteristicCallbacks, public NimBLEServerCallbacks {
public:
    explicit Esp32BleUi(std::shared_ptr<Esp32Cli::Cli> cli);

    ~Esp32BleUi() override;

    void onWrite(NimBLECharacteristic* pCharacteristic, ble_gap_conn_desc* desc) override;

    void onConnect(NimBLEServer* pServer, ble_gap_conn_desc* desc) override;

    void onDisconnect(NimBLEServer* pServer, ble_gap_conn_desc* desc) override;

    void setKeyValueStore(std::shared_ptr<KeyValueStore>);

private:
    class Client;

    void onRxWrite(ble_gap_conn_desc* desc);

    [[noreturn]] void processTxQueue();

    static void runTxQueue(void* arg) {
        static_cast<Esp32BleUi*>(arg)->processTxQueue();
    }

    [[noreturn]] void processMetrics();

    void processChangedMetricsBuffer();

    static void runMetrics(void* arg) {
        static_cast<Esp32BleUi*>(arg)->processMetrics();
    }

    static void runClient(void* arg);

    TaskHandle_t m_metricsTask{nullptr};
    TaskHandle_t m_txTask{nullptr};
    NimBLEServer* m_bleServer{nullptr};
    NimBLEService* m_bleService{nullptr};
    NimBLECharacteristic* m_rxCharacteristic;
    NimBLECharacteristic* m_rxAckCharacteristic;
    NimBLECharacteristic* m_txCharacteristic;
    NimBLECharacteristic* m_uiCharacteristic;
    std::mutex m_clientsMutex;
    std::vector<std::shared_ptr<Client> > m_clients;
    std::shared_ptr<Esp32Cli::Cli> m_cli;
    std::mutex m_metricsMutex;
    std::shared_ptr<KeyValueStore> m_metrics;
    LightweightMap<std::shared_ptr<const KeyValueStore::Value>> m_changedMetrics;
    RingBuffer<uint8_t, 128> m_changedMetricsBuffer;
};
